{
    "navbar": {
        "home": "Inicio",
        "projects": "Proyectos",
        "certificates": "Certificados",
        "skills": "Habilidades",
        "about-me": "Sobre m铆",
        "contact": "Contacto",
        "aria": {
            "home": "Navegar a la secci贸n de Inicio",
            "projects": "Navegar a la secci贸n de Proyectos",
            "skills": "Navegar a la secci贸n de Habilidades",
            "about-me": "Navegar a la secci贸n de Sobre m铆"
        }
    },
    "home": {
        "name": "Erick Solis",
        "title": "Desarrollador Full Stack",
        "bio1": "隆Hola! Soy Erick Solis, Desarrollador Full Stack, apasionado por crear soluciones web innovadoras y 煤tiles.",
        "bio2": "Tengo experiencia en tecnolog铆as frontend y backend, combinando creatividad, l贸gica y dise帽o para construir aplicaciones funcionales y escalables.",
        "bio3": "Me considero proactivo, orientado a resultados y comprometido con la calidad y la mejora continua.",
        "cv": "CV"
    },
    "projects": {
        "title": "Proyectos",
        "list": [
            {
                "title": "Book Platform",
                "shortDescription": "Plataforma web para registrar y gestionar libros con autenticaci贸n de usuarios.",
                "longDescription": "Book Platform es una aplicaci贸n dise帽ada para ayudar a los usuarios a organizar y administrar su propia biblioteca digital. Permite registrar libros de manera sencilla, mantenerlos ordenados en un dashboard intuitivo y acceder a ellos en cualquier momento. Cada usuario cuenta con una experiencia personalizada, donde puede gestionar 煤nicamente sus propios libros tras registrarse e iniciar sesi贸n. Esta plataforma busca ser una soluci贸n pr谩ctica y moderna para quienes desean tener control sobre sus lecturas y mantener un seguimiento claro de su colecci贸n."
            },
            {
                "title": "Explorify",
                "shortDescription": "Aplicaci贸n web para crear, editar y explorar art铆culos colaborativos sobre viajes.",
                "longDescription": "Explorify es una aplicaci贸n web colaborativa dise帽ada para que los usuarios puedan compartir y descubrir experiencias de viaje. Permite crear, editar y explorar art铆culos sobre destinos o consejos tur铆sticos, fomentando la participaci贸n dentro de una comunidad digital. Cada usuario cuenta con autenticaci贸n segura y un sistema de medallas que reconoce su actividad. La plataforma est谩 desarrollada con ReactJS, NodeJS, Express y MongoDB, e integra un editor de texto enriquecido con React Quill. Explorify busca conectar a las personas a trav茅s de historias reales y promover el intercambio de conocimiento sobre el mundo de los viajes."
            }
        ],
        "buttons": {
            "visitPage": "Visitar p谩gina",
            "viewMore": "Ver m谩s",
            "visitRepo": "Visitar el repositorio"
        }
    },
    "certificates": {
        "title": "Certificados",
        "list": [
            {
                "title": "Curso Profesional de Git",
                "shortDescription": "Control de versiones de c贸digo con Git.",
                "longDescription": "Complet茅 el Curso Profesional de Git en C贸digo Facilito, obteniendo conocimientos s贸lidos en control de versiones, manejo de ramas, flujos de trabajo y estrategias de colaboraci贸n. Este certificado me permite desenvolverme de manera efectiva en entornos profesionales con Git."
            },
            {
                "title": "Curso Profesional de GitHub",
                "shortDescription": "Buenas pr谩cticas en gesti贸n de proyectos con GitHub.",
                "longDescription": "Complet茅 el Curso Profesional de GitHub en C贸digo Facilito, aprendiendo a usar GitHub para colaboraci贸n, gesti贸n de issues, revisiones de c贸digo, pull requests e integraci贸n continua. Esta formaci贸n mejor贸 mis habilidades en entornos de desarrollo colaborativo."
            },
            {
                "title": "Curso Profesional de JavaScript",
                "shortDescription": "Formaci贸n avanzada en JavaScript con buenas pr谩cticas.",
                "longDescription": "Complet茅 el Curso Profesional de JavaScript en C贸digo Facilito, donde aprend铆 conceptos avanzados como programaci贸n as铆ncrona, caracter铆sticas de ES6+ y buenas pr谩cticas en el desarrollo de aplicaciones. Esta formaci贸n fortaleci贸 mi capacidad para construir soluciones escalables y eficientes usando JavaScript moderno."
            }
        ],
        "buttons": {
            "viewMore": "Ver m谩s"
        }
    },
    "skills": {
        "technical": "Habilidades",
        "tools": "Herramientas"
    },
    "about": {
        "title": "Sobre M铆",
        "name": "Erick Solis",
        "role": "Desarrollador Full Stack",
        "description": "Soy un desarrollador de software con pasi贸n por crear soluciones que aporten valor real a las personas. Me gusta entender las necesidades de los usuarios y transformar ideas en aplicaciones funcionales, accesibles y bien dise帽adas. Actualmente busco mi primera oportunidad profesional como Desarrollador Full Stack, en un entorno donde pueda aprender, aportar y seguir creciendo. En constante aprendizaje y comprometido con la calidad, la innovaci贸n y la mejora continua."
    },
    "footer": "Creado por Erick Solis "
}